<?php
$isREG=1;                     //是否开启注册           0关闭  1开启;
$isPin=1;                     //是否开启验证码         0关闭  1开启;
$isUP=1;                      //是否开启修改密码功能   0关闭  1开启;
$isFP=1;                      //是否开启找回密码功能   0关闭  1开启;
$isCZ=0;                      //是否开查询钻石功能     0关闭  1开启;
$isGD=0;                      //是否开启注册赠送钻石   0关闭  1开启;
$PVlevel=0; 	              //帐户注册权限;
$GDnum=10000;                 //赠送钻石数量;
$ADMIN="admin";               //后台管理账号 填写该账号时请确认该账号必须存在,如果没有账号请注册一个账号后填写;
$SQLhost="127.0.0.1";     //mysql地址 本地填:localhost 或 127.0.0.1;
$SQLuser="root";              //mysql用户名;
$SQLPWD="123456";             //mysql密码;
$DATABASE="bloodwar";       //数据库名称
?>