function getPassType()
{
	return "myrxsg";
}
function getPayUrl()
{
	//修改gameserver的值为服务器序号
	return "http://127.0.0.1/?gamename=rxsg&gameserver=S194&username=";
}
function getRegisterUrl()
{
	return "http://127.0.0.1/user/reg.php";
}
function getAutoLogin()
{
	return false;
}
function getAnnounceUrl()
{
	return  "http://127.0.0.1/rxsg/youxin/gg/index.html";
}
function getHomeUrl()
{
	return "http://127.0.0.1/rxsg";
}
function getBBSUrl()
{
	return "http://127.0.0.1/forum-59-1.html";
}
function getHelpUrl()
{
	return "http://127.0.0.1/rxsg/index_wjgl.html";
}

function getUnionBBSUrl()
{
	return "http://127.0.0.1/forum-59-1.html";
}
function getHomeButton()
{
	return "专区首页";
}
function getUserRule()
{
	return "<font size='16' color='#FFFF00'><b>一、 帐号管理规则</b></font><br/><br/>1. 玩家游戏时使用的君主名、游戏中的城池名、联盟名、旗号、将领等自定义命名均不得使用违反国家法规或带侮辱性的词语；<br/>2. 所有注册账号只可用于玩家进行正常的游戏，不得用于对游戏进行恶意攻击或破坏，4399《热血三国》官方有权对任何不符合游戏规则的账号进行封号和删除；<br/>3. 玩家60天未使用账号登录游戏，该账号将被系统自动删除；<br/><br/><font size='16' color='#FFFF00'><b>二、游戏漏洞规则</b></font><br/><br/>1. 4399《热血三国》官方鼓励玩家报告游戏中出现的问题和漏洞，一经证实将有机会获得官方的奖励；<br/>2. 所有利用游戏中的漏洞进行非法谋利或恶意攻击的行为被严格禁止，一经发现，账号将被删除；<br/>3. 对于可能导致严重影响游戏平衡性的重大问题，4399《热血三国》官方有权进行修正、回档或停止服务器运行；<br/><br/><font size='16' color='#FFFF00'><b>三、游戏辅助工具规则</b></font><br/><br/>1. 本游戏禁止采用非官方提供的游戏辅助工具，由此带来的任何后果由玩家自己负责；<br/>2. 4399《热血三国》官方保留对采用游戏辅助工具进行游戏的账号的处置权；<br/><br/><font size='16' color='#FFFF00'><b>四、游戏行为准则</b></font><br/><br/>1. 同意并按照4399《热血三国》官方不时发布、变更和修改的本玩家规则及其他规则，接受并使用我们的产品和服务，玩家不得通过不正当的手段或其他不公平的手段使用我们的产品和服务或参与我们活动。<br/>2. 玩家不得干扰官方正常地提供产品和服务，包括但不限于：<br/>（1）攻击、侵入官方网站、游戏、论坛服务器或使服务器过载；<br/>（2）破解、修改官方提供的游戏程序；<br/>（3）攻击、侵入官方的游戏服务器或游戏服务器端程序或使游戏服务器过载；<br/>（4）制作、发布、传播任何形式的妨碍游戏公平性的辅助工具或程序（外挂）；<br/>（5）利用程序的漏洞和错误（Bug）破坏游戏的正常进行或传播该漏洞或错误（Bug）；<br/>（6）不合理地干扰或阻碍他人使用我们所提供的产品和服务。 <br/>3. 玩家必须保管好自己的账号和密码，由于玩家个人的原因导致账号和密码泄密而造成的后果均将由该玩家自行承担。<br/>4. 玩家仅能以一个单独的个人的身份使用官方所提供的产品和服务，不能利用官方所提供的产品和服务从事商业目的的活动，也不能利用官方的产品和服务进行销售或其他商业目的的活动。<br/>5. 玩家需对自己账号中的所有活动和事件负责。须遵守有关互联网信息发布的有关法律、法规及通常适用的互联网一般道德和礼仪的规范，玩家将自行承担其所发布的信息内容的责任。特别的，玩家不得发布下列内容：<br/>（1）反对宪法所确定的基本原则的；<br/>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br/>（3）损害国家荣誉和利益的；<br/>（4）煽动民族仇恨、民族歧视，破坏民族团结的；<br/>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；<br/>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；<br/>（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；<br/>（8）侮辱或者诽谤他人，侵害他人合法权益的；<br/>（9）含有法律、行政法规禁止的其他内容的。<br/>（10）侵犯任何第三者的知识产权，版权或公众/私人权利的。<br/>（11）违反人文道德、风俗习惯的。<br/>（12）任何形式的未经4399《热血三国》运营团队允许的广告都是不允许的。<br/>6. 玩家的游戏账号、游戏角色，以及与官方产品相关的论坛昵称不得包含本规则第四条第5款所禁止发布的内容。<br/><br/><font size='16' color='#FFFF00'><b>五、对战玩法规则</b></font><br/><br/>《热血三国》是一款策略类的网页游戏，游戏中用户之间相互对战是这款游戏最基本的游戏规则。为此，根据文化部颁布的《网络游戏管理暂行办法》第十八条规定，特别提醒您：<br/>用户对战是《热血三国》游戏最基本的游戏规则，您同意对战的玩法后才能登录《热血三国》进行游戏。而且，如果有其他用户在游戏中主动要求对战，不论您是否已经登录游戏，您在游戏中创建的游戏角色以及城池都将会自动地积极地应战，并与之进行对战。<br/>对于《热血三国》游戏的上述玩法（即游戏规则），您是充分知晓、完全同意并接受的。您登录该游戏，即视为您充分知晓、完全同意并接受上述玩法。<br/><br/><font size='16' color='#FFFF00'><b>六、小号禁止规则</b></font><br/><br/>a. 每个玩家只允许拥有及控制一个游戏账号，一个玩家拥有或控制一个以上的游戏帐号是严格禁止的；<br/>b. 如果你对当前游戏帐号的发展情况不满意，你可以选择放弃该账号并重建注册账号，同时使用新旧2个账号的行为是禁止的；<br/>c. 严禁玩家之间的恶意串通占领行为，这包括两个或两个以上玩家之间的串通占领行为，一旦发现，所有参与串通占领的各方都将视为小号违规者受到惩罚，串通占领的判定由4399《热血三国》管理系统根据玩家的访问记录和行为记录分析获得；<br/>d. 严禁玩家之间的恶意串通战斗行为，这包括两个或两个以上玩家之间的串通攻击行为，一旦发现，所有参与串通战斗的各方都将视为小号违规者受到惩罚，串通战斗的判定由4399《热血三国》管理系统根据玩家的访问记录和行为记录分析获得，串通攻击包括互相攻击及联合攻击他人；<br/>e. 严禁玩家之间的恶意串通交易行为，这包括两个或两个以上玩家之间的串通交易行为，一旦发现，所有参与串通交易的各方都将视为小号违规者受到惩罚，串通交易的判定由4399《热血三国》管理系统根据玩家的访问记录和行为记录分析获得；<br/><br/><font size='16' color='#FFFF00'><b>七、小号判定标准（判例持续更新）</b></font><br/><br/>a. 同IP在多个游戏帐号之间买卖资源为小号行为；<br/>b. 不进行必要的城池建设，而仅频繁进行资源买卖的游戏帐号为小号行为；<br/>c. 多个帐号之间多次进行高价买卖的物品交易为小号行为；<br/>d. 使用代理在多个游戏帐号之间进行占领为小号行为；<br/>e. 不进行必要的城池建设，而任由其他帐号进行掠夺、占领的游戏帐号为小号；<br/><br/><font size='16' color='#FFFF00'><b>八、 惩罚规则</b></font><br/><br/>a. 警告：即对违规玩家进行警告。<br/>b. 禁言：即禁止违规玩家发言的权利；<br/>c. 剥夺：即剥夺违规玩家的所有非法所得；<br/>d. 削弱：即削弱违规玩家的包括生产和战争在内的能力；<br/>e. 封号：即封闭违规玩家的账号；<br/>f. 删号：即删除违规玩家的账号；<br/>g. 玩家对惩罚如有解释或意见，可以给管理员邮箱<font color='#2ebdd7'><u><a href='mailto:4399rxsg@163.com'>4399rxsg@163.com</a></u></font>发邮件进行说明，管理员有权根据实际情况决定是否更改处罚和回复结果。<br/><br/><font size='16' color='#FFFF00'><b>九、服务中断、停止和变更的说明</b></font><br/><br/>发生下列情形之一时，官方有权中断、停止或变更其所提供的服务，对于因此而产生的困扰、不便或损失，官方不承担任何责任：<br/>1.定期检查或施工，软硬件更新等，即暂停服务，官方将尽快完成维修、维护工作。<br/>2.服务器遭到任何形式的破坏，无法正常运作。<br/>3.网络线路或其它导致玩家通过Internet连接至游戏服务器的动作发生滞碍等情形。<br/>4.自然灾害等不可抗力的因素。<br/>5.在紧急情况之下为维护国家安全或其它会员及第三者人身安全时。<br/>6.发生突发性软硬件设备与电子通信设备故障时。<br/><br/><br/><font size='16' color='#FFFF00'><b>十、知识产权</b></font><br/><br/>官方所提供的产品和服务仅供玩家个人及非商业目的使用。与产品和服务有关的全部信息、资料、技术（包括相关的软件）的著作权、专利权、商标、商业秘密、其他知识产权、所有权或其他权利，均为官方或其权利人所有，除非事先获得官方或其权利人的合法授权，不得对任何该信息、资料、软件、产品和服务进行修改、拷贝、散布、传送、展示、执行、复制、发行、授权、制作衍生著作、移转或销售。如果玩家未遵守本条款的上述规定，官方可立即终止向其提供产品和服务，玩家同时必须销毁任何获得的上述信息、资料、软件或产品。<br/><br/><br/><font size='16' color='#FFFF00'><b>十一、游戏规则的解释、更改和添加</b></font><br/><br/>本规则的解释、效力及适用以中华人民共和国法律为依据。如果本协议的任何内容与法律相抵触，应以法律规定为准。<br/>此前提下，4399《热血三国》官方保留解释、更改和添加游戏规则的权利，规则解释、更加和添加自公布之时起生效。请玩家时刻关注本规则。";
}
function getCustomerUrl()
{
	return "http://127.0.0.1/";
}
function getChibiEndPoint()
{
	return "http://127.0.0.1/server/amfphp/gateway.php";
}